
/*****************************************************************************
 **************       大学生电器开发部 -- E.D.D     ***************************
 *****************************************************************************
 *  适用于电器开发部12级学习板，STC12@32M晶振
 *  File name: timer.c
 *  Author: E.D.D
 *  Date: 2016-1-20 
 *  Version: V2.0
 *  Description: 定时器相关函数说明
 *  Copyright (C) E.D.D -- HPU
 *****************************************************************************/
 
#include "timer.h"

#define LED_GREEN P13      /* 把P13进行宏定义，在文件中P13就可以直接写成LED_GREEN，增加可读性 */
                           /* 记得把跳线帽调到指定位置 */
uint32 sys_time = 0;
uint8 flag = 0;

/**
  *  函数名称：Timer0Init
  *  函数参数：无
  *  函数功能：Timer0 初始化并开中断
  *  日期：2016-1-20
  */
void Timer0_Init(void)		//1毫秒@32MHz
{
	AUXR |= 0x80;		//定时器时钟1T模式
	TMOD &= 0xF0;		//设置定时器模式
   TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x00;		   //设置定时初值         
	TH0 = 0x83;		   //设置定时初值      课下作业：定时器的初值是怎么算出来的？
	TF0 = 0;		      //清除TF0标志
	
	EA = 1;           /* 开总中断 */
	ET0 = 1;          /* 开定时器0中断 */
	TR0 = 1;		      /* 定时器0开始计时 */
}

void Timer0_Interrupt()  interrupt 1
{	
	TL0 = 0x00;		
	TH0 = 0x83;		/* 设置定时初值 */
	sys_time ++;
   if(1000 == sys_time)
	{
	   sys_time = 0;
		flag = 1;
		LED_GREEN = !LED_GREEN;
	}
}
