
/*****************************************************************************
 **************       大学生电器开发部 -- E.D.D     ***************************
 *****************************************************************************
 *  适用于电器开发部12级学习板，STC12@32M晶振
 *  File name: timer.c
 *  Author: E.D.D
 *  Date: 2016-1-20 
 *  Version: V2.0
 *  Description: 定时器相关函数说明
 *  Copyright (C) E.D.D -- HPU
 *****************************************************************************/
 
#include "timer.h"

uint32 time = 0;
uint8 flag = 0;

/**
  *  函数名称：Timer0Init
  *  函数参数：无
  *  函数功能：Timer0 初始化并开中断
  *  日期：2016-1-20
  */
void Timer0Init(void)		//1毫秒@32MHz
{
	AUXR |= 0x80;		//定时器时钟1T模式
	TMOD &= 0xF0;		//设置定时器模式
   TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x00;		   //设置定时初值
	TH0 = 0x83;		   //设置定时初值
	TF0 = 0;		      //清除TF0标志
	
	ET0 = 1;
	TR0 = 0;		      //定时器0停止计时
}

void Timer0_Interrupt()  interrupt 1
{
	TL0 = 0x00;		//设置定时初值
	TH0 = 0x83;		//设置定时初值
	time ++;
	NUM_ShowScan();
	if(time == 1000)
	{
		time = 0;
		flag = 1;
	   P13 = ~P13;
	}
}
