
/*****************************************************************************
 **************       大学生电器开发部 -- E.D.D     ***************************
 *****************************************************************************
 *  适用于电器开发部15级学习板，STC15@32M晶振
 *  File name：test.c
 *  Author: E.D.D
 *  Date: 2016-1-20 
 *  Version: V2.0
 *  Description: 主函数
 *  Copyright (C) E.D.D -- HPU
 *****************************************************************************/
 
#include <STC12C5A60S2.H>
#include "led.h"
#include "timer.h"    /* 要添加定时器的头文件 */
#include "num_led.h"

extern uint8 flag;     /* 外部变量声明，声明时不要出现赋值 */

//void main(void)      /* 此main函数是单个数码管的自加程序 */
//{
//	NUM_LED_Init();
//	Timer0_Init();

//	while(1)
//	{
//	   if(1 == flag)
//		{
//			flag = !flag;  /* 清除标志位 */
//		   NUM_ShowScan();
//		}
//	}
//}

void main(void)         /* 此main函数是流水灯的程序 */
{
	Led_Init();
	Timer0_Init();

	while(1)
	{
	   if(1 == flag)
		{
			flag = !flag;  /* 清除标志位 */
		   Led_Scan();
		}
	}
}

/****************   注意事项  **********************/
/*   两个main函数不能共用,用两个之一将另一个注释  ****/

/****************    课下思考  ********************/
/*  如何将这两个功能一起实现
 *  流水灯可以工作，数码管也能正常工作？？？       **/



