
/*****************************************************************************
 **************       大学生电器开发部 -- E.D.D     ***************************
 *****************************************************************************
 *  适用于电器开发部15级学习板，STC15@32M晶振
 *  File name: led.c
 *  Author: E.D.D
 *  Date: 2016-1-20 
 *  Version: V2.0
 *  Description: led相关函数说明
 *  Copyright (C) E.D.D -- HPU
 *****************************************************************************/
 
#include "led.h"
#define P0_ENABLE P11

/**
  *  函数名称：Led_Init
  *  函数参数：无
  *  函数功能：led初始化
  *  日期：2016-1-20
  */
void Led_Init(void)
{
	P2 &= (uint8)~(7<<0);    /* 将后三位清零 */
	P2 |= (uint8)(3<<1);     /* 将低三位置于 1 1 0 */
	P0_ENABLE = 0;
	P0 = 0xff;     /* 使小灯全灭 */
}

/**
  *  函数名称：Led_Scan
  *  函数参数：无
  *  函数功能：跑马灯--led扫描
  *  日期：2016-1-20
  */
void Led_Scan(void)
{
	static uint8 i = 0;
	
   P11 = 1;
	P0 = (uint8)~(1<<i++);   /* 通过循环点亮每个小灯 */
	i &= 0x07;
	P11 = 0;
}
